Autodesk.Navisworks.Api.Plugins.RibbonLayoutRecord
Represents the definition of a ribbon layout in the GUI system

Autodesk.Navisworks.Api.Plugins.RibbonLayoutRecord.Xaml
The path to the Xaml file that specifies the layout of ribbon and commands